special_character_mappings = {    
        # à, á, â, ã, ä, å, æ
        "lower_a":{
            "a":"ã",            
            "s":"à",
            "d":"á",
            "f":"â",
            "q":"ä",
            "w":"å",
            "e":"æ",
            },
        # À, Á, Â, Ã, Ä, Å, Æ
        "upper_a":{
            "a":"Ã",            
            "s":"À",
            "d":"Á",
            "f":"Â",
            "q":"Ä",
            "w":"Å",
            "e":"Æ",
            },
        # è, é, ê, ë
        "lower_e":{            
            "a":"è",
            "s":"é",
            "d":"ê",
            "f":"ë",
            },
        # È, É, Ê, Ë
        "upper_e":{            
            "a":"È",
            "s":"É",
            "d":"Ê",
            "f":"Ë",
            },
        # ì, í, î, ï,
        "lower_i":{            
            "a":"ì",
            "s":"í",
            "d":"î",
            "f":"ï",
            },
        # Ì, Í, Î, Ï, 
        "upper_i":{            
            "a":"Ì",
            "s":"Í",
            "d":"Î",
            "f":"Ï",
            },
        # ò, ó, ô, õ, ö, ø
        "lower_o":{
            "a":"õ",            
            "s":"ò",
            "d":"ó",
            "f":"ô",
            "q":"ö",
            "w":"ø",
            },
        # Ò, Ó, Ô, Õ, Ö, Ø
        "upper_o":{
            "a":"Õ",            
            "s":"Ò",
            "d":"Ó",
            "f":"Ô",
            "q":"Ö",
            "w":"Ø",
            },
        # ù, ú, û, ü
        "lower_u":{            
            "a":"ù",
            "s":"ú",
            "d":"û",
            "f":"ü",
            },
        # Ù, Ú, Û, Ü 
        "upper_u":{            
            "a":"Ù",
            "s":"Ú",
            "d":"Û",
            "f":"Ü",
            },
        # ñ, ý, ÿ, ð, ç, œ, ß,  
        "lower_misc":{            
            "a":"ñ",
            "s":"ý",
            "d":"ÿ",
            "f":"ð",
            "q":"ç",
            "w":"œ",
            "e":"ß",
            },
        # Ñ, Ý, Ÿ, Ð, Ç, Œ, ¿, ¡ 
        "upper_misc":{            
            "a":"Ñ",
            "s":"Ý",
            "d":"Ÿ",
            "f":"Ð",
            "q":"Ç",
            "w":"Œ",
            "e":"¿",
            "r":"¡",
            },
        # £, ¢, ¥, €, ₩, руб, ₤
        "currency":{            
            "a":"€",
            "s":"¥",
            "d":"¢",
            "f":"£",
            "q":"₤",
            "w":"₩",
            "e":"руб",
            },
}    
